## Numpy

In [2]:
a = [1,2,3]
b = [2,3,4]

In [3]:
[f*s for f, s in zip(a,b)]

[2, 6, 12]

In [4]:
import numpy
a = numpy.array([1,2,3])
b = numpy.array([2,3,4])

In [5]:
a * b

array([ 2,  6, 12])

In [6]:
import numpy as np
na = np.array([['name', 'gender', 'age'], ['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
na

array([['name', 'gender', 'age'],
       ['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']],
      dtype='<U6')

In [7]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [8]:
df.columns = ['name', 'gender', 'age']

In [9]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

## Series

In [10]:
import pandas as pd
phone = pd.Series([21000,18900,18000])
phone

0    21000
1    18900
2    18000
dtype: int64

In [11]:
phone = pd.Series([21000,18900,18000], index = ['Iphone 7', 'Oppo', 'Moto'])
phone

Iphone 7    21000
Oppo        18900
Moto        18000
dtype: int64

In [12]:
phone[1]

18900

In [13]:
phone[1:3]

Oppo    18900
Moto    18000
dtype: int64

In [14]:
phone['Oppo']

18900

## DataFrame

In [15]:
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [16]:
df.columns = ['name', 'gender', 'age']

In [17]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [18]:
df.head(3)

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35

In [19]:
df.tail(3)

   name gender  age
3   ted      M   33
4  jean      F   21
5  lisa      F   20

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
name      6 non-null object
gender    6 non-null object
age       6 non-null int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [21]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [22]:
df.ix[1:2,['name', 'age']]

   name  age
1  mary   23
2   tom   35

## 數據篩選

In [23]:
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [24]:
df.ix[1]

name      mary
gender       F
age         23
Name: 1, dtype: object

In [25]:
df.ix[1:4]

   name gender  age
1  mary      F   23
2   tom      M   35
3   ted      M   33
4  jean      F   21

In [26]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [27]:
df[['name','age']]

    name  age
0  frank   29
1   mary   23
2    tom   35
3    ted   33
4   jean   21
5   lisa   20

In [28]:
df.ix[ 1:2 , ['name', 'age']  ]

   name  age
1  mary   23
2   tom   35

In [29]:
?df.ix

In [30]:
df['gender']

0    M
1    F
2    M
3    M
4    F
5    F
Name: gender, dtype: object

In [31]:
df.gender

0    M
1    F
2    M
3    M
4    F
5    F
Name: gender, dtype: object

In [32]:
df['gender'] == 'M'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [33]:
df[df['gender'] == 'M']

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [34]:
df['age'] > 30

0    False
1    False
2     True
3     True
4    False
5    False
Name: age, dtype: bool

In [35]:
df[df['age'] > 30]

  name gender  age
2  tom      M   35
3  ted      M   33

In [36]:
df[(df['gender'] == 'M') & (df['age'] > 30)]

  name gender  age
2  tom      M   35
3  ted      M   33

In [37]:
df[(df['gender'] == 'M') | (df['age'] > 30)]

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [38]:
df['employee'] = True

In [39]:
df.head()

    name gender  age employee
0  frank      M   29     True
1   mary      F   23     True
2    tom      M   35     True
3    ted      M   33     True
4   jean      F   21     True

In [40]:
del df['employee']

In [41]:
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [42]:
df['employee'] = True
df.head()

    name gender  age employee
0  frank      M   29     True
1   mary      F   23     True
2    tom      M   35     True
3    ted      M   33     True
4   jean      F   21     True

In [43]:
df = df.drop('employee', axis = 1)

In [44]:
df.head()

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21

In [45]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [48]:
df.loc[5]

name      lisa
gender       F
age         20
Name: 5, dtype: object

In [58]:
df.loc[6] = {'age':20, 'gender': 'F', 'name':'qoo'}

In [61]:
df = df.drop(6)
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [64]:
df = df.append(pd.DataFrame([{'age':20, 'gender': 'F', 'name':'qoo'}]), ignore_index=True)

In [67]:
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa
6   20      F    qoo

In [70]:
df = df.drop(6)

In [71]:
df

   age gender   name  userid
0   29      M  frank     101
1   23      F   mary     102
2   35      M    tom     103
3   33      M    ted     104
4   21      F   jean     105
5   20      F   lisa     106

In [72]:
df['userid'] = range(101,107)

In [74]:
df

   age gender   name  userid
0   29      M  frank     101
1   23      F   mary     102
2   35      M    tom     103
3   33      M    ted     104
4   21      F   jean     105
5   20      F   lisa     106

In [75]:
df.set_index('userid', inplace=True)

In [77]:
df

        age gender   name
userid
101      29      M  frank
102      23      F   mary
103      35      M    tom
104      33      M    ted
105      21      F   jean
106      20      F   lisa

In [79]:
df.iloc[1]

age         23
gender       F
name      mary
Name: 102, dtype: object

In [81]:
df.iloc[[1,3,5]]

        age gender  name
userid
102      23      F  mary
104      33      M   ted
106      20      F  lisa

In [82]:
df.ix[[101,103,105]]

        age gender   name
userid
101      29      M  frank
103      35      M    tom
105      21      F   jean

In [83]:
df.loc[[101,103,105]]

        age gender   name
userid
101      29      M  frank
103      35      M    tom
105      21      F   jean